cfd/legendSedan_6_5/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    ddtSchemes
    {
        default 	steadyState;
    }

    gradSchemes
    {
        //default 	Gauss linear;
        default 	cellLimited Gauss linear 1;
        grad(U) 	cellLimited Gauss linear 1;
        grad(k) 	cellLimited Gauss linear 1;
        grad(omega) 	cellLimited Gauss linear 1;
        grad(p) 	cellLimited Gauss linear 0.333;
    }

    divSchemes
    {
        default 		none;

        //div(phi,U) 		bounded Gauss linearUpwindV grad(U);
        div(phi,U) 		bounded Gauss linearUpwind grad(U);

        //div(phi,k) 		bounded Gauss linearUpwind grad(k);
        //div(phi,omega) 	bounded Gauss linearUpwind grad(omega);
        div(phi,k) 		bounded Gauss upwind;
        div(phi,omega) 		bounded Gauss upwind;

        div((nuEff*dev2(T(grad(U))))) Gauss linear;

//For potentialFoam
        div(div(phi,U))   	Gauss linear;

    }

    interpolationSchemes
    {
        //default linear;
        default skewCorrected linear;
    }

    laplacianSchemes
    {
        default Gauss linear limited 0.5;
    }

    snGradSchemes
    {
        default limited 0.5;
    }

    wallDist
    {
        method meshWave;
    }

// ************************************************************************* //
